# Split Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..Split Property
ViewCropRegionShapeManager Class See Also
---
Whether or not the view crop is split.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool Split { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Split As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Split {
	bool get ();
}
```

# Remarks
This property reflects the actual visual split of the crop region. Thus, if the view has non-rectangular crop shape set, this property is false.
# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace